src/cf/InformationRegisters/ПодключениеКомбинированныхПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПодключениеКомбинированныхПриложений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусКомбинированногоПриложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусКомбинированногоПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусКомбинированногоПриложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗарегистрированоОбновление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарегистрированоУдаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользовалось</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подключено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ПодключениеКомбинированныхПриложений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает статусы приложений
//
// Параметры:
//  ИменаПриложений - Массив из Строка, Неопределено - если передано, то будут получены статусы указанных приложений
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Период - Дата
//   * ИмяПриложения - Строка
//   * Статус - ПеречислениеСсылка.СтатусКомбинированногоПриложения
//   * ОписаниеСобытия - Строка
//
Функция СтатусПриложений(ИменаПриложений = Неопределено) Экспорт
	
	ОписаниеПриложений = ТЗОписанияПриложений(ИменаПриложений);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОписаниеПриложений.Имя КАК Имя
	|ПОМЕСТИТЬ ВТОписаниеПриложений
	|ИЗ
	|	&ОписаниеПриложений КАК ОписаниеПриложений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодключениеКомбинированныхПриложенийСрезПоследних.Период КАК Период,
	|	ВТОписаниеПриложений.Имя КАК ИмяПриложения,
	|	ЕСТЬNULL(ПодключениеКомбинированныхПриложенийСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусКомбинированногоПриложения.НеИспользовалось)) КАК Статус,
	|	ПодключениеКомбинированныхПриложенийСрезПоследних.ОписаниеСобытия КАК ОписаниеСобытия
	|ИЗ
	|	ВТОписаниеПриложений КАК ВТОписаниеПриложений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодключениеКомбинированныхПриложений.СрезПоследних КАК ПодключениеКомбинированныхПриложенийСрезПоследних
	|		ПО ВТОписаниеПриложений.Имя = ПодключениеКомбинированныхПриложенийСрезПоследних.ИмяПриложения";
	
	Запрос.УстановитьПараметр("ОписаниеПриложений", ОписаниеПриложений);
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗарегистрироватьСобытие(ИмяПриложения, Статус, ОписаниеСобытия = "") Экспорт
	
	Запись = РегистрыСведений.ПодключениеКомбинированныхПриложений.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДатаСеанса();
	Запись.ИмяПриложения = ИмяПриложения;
	Запись.Статус = Статус;
	Запись.ОписаниеСобытия = ОписаниеСобытия;
	
	УстановитьПривилегированныйРежим(Истина);
	Запись.Записать(Истина);
	
КонецПроцедуры

// Проверяет, есть ли подключенные комбинированные приложения
// 
// Возвращаемое значение:
//  Булево
//
Функция ЕстьПодключенныеПриложения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодключениеКомбинированныхПриложенийСрезПоследних.ИмяПриложения КАК ИмяПриложения
	|ИЗ
	|	РегистрСведений.ПодключениеКомбинированныхПриложений.СрезПоследних КАК ПодключениеКомбинированныхПриложенийСрезПоследних
	|ГДЕ
	|	ПодключениеКомбинированныхПриложенийСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусКомбинированногоПриложения.Подключено)";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПриложенияДляОтключения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодключениеКомбинированныхПриложенийСрезПоследних.ИмяПриложения КАК ИмяПриложения
	|ИЗ
	|	РегистрСведений.ПодключениеКомбинированныхПриложений.СрезПоследних КАК ПодключениеКомбинированныхПриложенийСрезПоследних
	|ГДЕ
	|	ПодключениеКомбинированныхПриложенийСрезПоследних.Статус = &Статус";
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусКомбинированногоПриложения.ЗарегистрированоУдаление);
	
	ИменаПриложений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяПриложения");
	Возврат ОписаниеПриложенийСОтборомПоИмени(ИменаПриложений);
	
КонецФункции

Функция ПриложенияДляПодключения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодключениеКомбинированныхПриложенийСрезПоследних.ИмяПриложения КАК ИмяПриложения
	|ИЗ
	|	РегистрСведений.ПодключениеКомбинированныхПриложений.СрезПоследних КАК ПодключениеКомбинированныхПриложенийСрезПоследних
	|ГДЕ
	|	ПодключениеКомбинированныхПриложенийСрезПоследних.Статус = &Статус";
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусКомбинированногоПриложения.ЗарегистрированоОбновление);
	
	ИменаПриложений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяПриложения");
	Возврат ОписаниеПриложенийСОтборомПоИмени(ИменаПриложений);
	
КонецФункции

Функция ПодключенныеПриложения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодключениеКомбинированныхПриложенийСрезПоследних.ИмяПриложения КАК ИмяПриложения
	|ИЗ
	|	РегистрСведений.ПодключениеКомбинированныхПриложений.СрезПоследних КАК ПодключениеКомбинированныхПриложенийСрезПоследних
	|ГДЕ
	|	ПодключениеКомбинированныхПриложенийСрезПоследних.Статус = &Статус";
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусКомбинированногоПриложения.Подключено);
	
	ИменаПриложений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяПриложения");
	Возврат ОписаниеПриложенийСОтборомПоИмени(ИменаПриложений);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТЗОписанияПриложений(ИменаПриложений = Неопределено)
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить(
	"Имя", Метаданные.РегистрыСведений.ПодключениеКомбинированныхПриложений.Измерения.ИмяПриложения.Тип);
	
	ОписаниеПриложений = ТарификацияБизнес.ОписаниеВсехПриложений();
	Для каждого ОписаниеПриложения Из ОписаниеПриложений Цикл
		
		Если ИменаПриложений <> Неопределено И ИменаПриложений.Найти(ОписаниеПриложения.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Имя = ОписаниеПриложения.Имя;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеПриложенийСОтборомПоИмени(ИменаПриложений)
	
	Результат = Новый Массив;
	
	ОписаниеПриложений = ТарификацияБизнес.ОписаниеВсехПриложений();
	Для каждого ОписаниеПриложения Из ОписаниеПриложений Цикл
		Если ИменаПриложений.Найти(ОписаниеПриложения.Имя) <> Неопределено Тогда
			Результат.Добавить(ОписаниеПриложения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
